// حل تمرین


// زوج یا فرد بودن یک عدد
let add = Number(prompt("لطفا عدد مورد نظر را وارد کنید : ",0))
if(add%2 == 0){
    alert("این عدد زوج است")
}else {
    alert("این عدد فرد است")
}
//////////////////////////////////////////////////////////////////

// میانگین اعداد
let num1 = Number(prompt("number1 : "))
let num2 = Number(prompt("number2 : "))
let num3 = Number(prompt("number3 : "))
alert("میانگین این 3 عدد : " + (num1+num2+num3)/3)
//////////////////////////////////////////////////////////////////

// محدودیت سنی
let num = Number(prompt("لطفا سن خود را نمایش دهید : "))
if(num < 18){
    alert("شما مجاز به ورود نیستید")
}else {
    alert("ورود به پنل ")
}
///////////////////////////////////////////////////////////////////

// توان برای اعداد ورودی
let num = Number(prompt("لطفا عدد مورد نظر را وارد کنید :"))
let tavan = Number(prompt("توان مورد نظر را وارد کنید : "))
alert(num + "به توان " + tavan + "مساوی است با :"+ "  " + num**tavan)
////////////////////////////////////////////////////////////////////

//محاسبه سن کاربر :
let avege = Number(prompt("لطفا تاریخ سال تولد خود را وارد کنید : "))
alert(1400 - avege)
////////////////////////////////////////////////////////////////////

//تبدیل دقیقه به ساعت
let min = Number(prompt("لطفا دقیقه مورد نظر را وارد کنید : "))
alert(min/60 + 'h')
//////////////////////////////////////////////////////////////////

//تعیین سطح
let age = Number(prompt("لطفا سن خود را وارد کنید : "))
let sex = prompt("جنسیت خود :man or woman ")

if(sex === "woman" || age < 18){
    alert("شما اجازه ورود ندارید")
}else {
    alert("شما وارد شدید!!!!")
}